ent-ClothingHandsGlovesCaptainWhite = белые перчатки капитана
    .desc = Королевские белые перчатки с золотой отделкой. Шикарны.

ent-ClothingHandsGlovesSheriff = перчатки шерифа
    .desc = Перчатки с эргономичной формой, предназначенные для удержания револьвера.

ent-ClothingHandsGlovesGoldenEra = золочёные силовые перчатки
    .desc = Пара прочных перчаток из металла и дюраткани, украшенная золотом.

ent-ClothingHandsGlovesNitrileBlack = чёрные нитриловые перчатки
    .desc = Высококачественные длинные нитриловые перчатки, обеспечивающие защиту от химикатов, грязи и заражения.

ent-ClothingHandsGlovesPaws = серые перчатки-лапки
    .desc = Пара мягких лапок для любого вашего косплея, десу.
