# SPDX-FileCopyrightText: 2026 Hyper B <137433177+HyperB1@users.noreply.github.com>
#
# SPDX-License-Identifier: AGPL-3.0-or-later

ent-StunbatonAgzamov = наградная шоковая дубинка Агзамова
    .desc = Довольно массивная шоковая дубинка, отдалённо напоминает биту. На рукояти виднеется надпись "Агзамов Д." Вы не хотите знать, за какие заслуги и каким именно способом владелец получил эту дубинку. От неё веет нарушением ОПРС.
    .suffix = { "Спонсорское, Agzamov, Ganimed" }

ent-ShipKnife = тактический нож "шип"
    .desc = Удобный тактический нож некрупного размера, используется спецподразделениями разных стран и корпораций. При работе с ним лучше беречь уши.
    .suffix = { "Спонсорское, As04ka, Ganimed" }

ent-KatanaLethalHoSSafno = термостойкая катана
    .desc = Катана, сделанная из особо прочных и термостойких сплавов, способная выдержать экстремальные напряжения и температуры. Превосходное средство для противостояния энергетическому оружию.
    .suffix = { ent-ClothingHeadHatBeretHoSSafno.suffix }
ent-KatanaStunHoSSafno = шоковая катана
    .desc = Электрошоковый короткий меч вакидзаси, имеющий отличную останавливающую силу за счёт меньшей площади удара тока. На рукоятке имеются инициалы владельца С. Йорсон. и мастера Т. В. Лапа, которые странно переплетаются в некоторых участках.
    .suffix = { ent-ClothingHeadHatBeretHoSSafno.suffix }
