# SPDX-FileCopyrightText: 2025 AltMapper <141431347+AltMapper@users.noreply.github.com>
# SPDX-FileCopyrightText: 2025 RedSpy <127129838+RedSpyy@users.noreply.github.com>
# SPDX-FileCopyrightText: 2026 Hyper B <137433177+HyperB1@users.noreply.github.com>
#
# SPDX-License-Identifier: AGPL-3.0-or-later

ent-ClothingBeltAssault = штурмовой пояс
    .desc = Тактический штурмовой пояс.

ent-ClothingBeltMilitaryWebbingCMO = пояс главного врача
    .desc = Медицинский нагрудник с глубокими карманами, предназначенный для использования парамедиками и медицинскими работниками.

ent-ClothingBeltMilitaryWebbingCorpsman = пояс бригмедика
    .desc = Боевая медицинская разгрузка с множеством герметичных карманов и подсумков.

ent-ClothingBeltOfficerBlackWebbing = чёрная офицерская РПС
    .desc = Это довольно удобная и не стесняющая движений РПС.

ent-ClothingBeltAmmo = разгрузка для магазинов
    .desc = Удобная разгрузка под любые ваши магазины, идеально подходит для затяжных перестрелок.

ent-ClothingBeltTacticalHolster = тактическая кобура
    .desc = Удобная универсальная кобура, закреплённая на широком эластичном ремне. Довольно вместительна и имеет возможность подгонки под размер оружия. К кобуре прикрелпена пара небольших подсумков, а также маленькая петля. При желании можно передвинуть кобуру под левую руку, если это требуется пользователю.

ent-ClothingBeltRevolverHolster = кобура для револьвера
    .desc = Немного потрёпанная кожаная кобура, подходящая ко множеству не слишком громоздких револьверов. На ремне, с противположный от кобуры, распологяется два маленьких подмсумка. При желании можно передвинуть кобуру под левую руку, если это требуется пользователю.

ent-ClothingBeltShellShotgun = бандольер для патронов 12х70
    .desc = Тактический бандольер для хранения ваших тактических патронов 12х70. Вы ведь умеете их быстро выхватывать и заряжать, да?

ent-ClothingBeltMedicalMarine = медицинская разгрузка
    .desc = Военная разгрузка с глубокими карманам, предназначенная для оказания медицинской помощи прямо на передовой.

ent-ClothingBeltSheathWhite = белые сабельные ножны
    .desc = Стиль, блеск, всё для лучших сабель во вселенной.

ent-ClothingBeltSheathSheriff = сабельные ножны шерифа
    .desc = Практичность, прочность, сабля точно не окажется в вашей ноге.

ent-ClothingBeltPouchMedical = медицинский подсумок
    .desc = Тактический подсумок для хранения медикаментов.

ent-ClothingBeltPouchUtility = универсальный подсумок
    .desc = Тактический подсумок для хранения различной мелочёвки.

ent-ClothingBeltPouchFlare = подсумок с сигнальным пистолетом
    .desc = Тактический подсумок с сигнальным пистолетом и снарядами к нему.
