ent-ClothingNeckMantleCaptainWhite = белая мантия капитана
    .desc = Мантия капитана, с белым пухом.

ent-ClothingNeckMantleBridgeOfficer = мантия офицера командования
    .desc = Элегантная мантия в черных цветах.

ent-ClothingNeckMantleSecurity = накидка службы безопасности
    .desc = Почётная накидка ветерана службы безопасности.

ent-ClothingNeckMantleQMAlt = классическая мантия квартирмейстера
    .desc = Уютная на вид накидка на плечи, от которой веет духом бунтарства и независимости. Или раздражения и иллюзий — дело ваше.

ent-ClothingNeckMantleMiner = мантия шахтёра
    .desc = Потрёпанное тканевое изделие, предназначенное для защиты носителя от космической пыли. На самом же деле может послужить лишь удобным саваном, позволяющим близким опознать тело.

ent-ClothingNeckMantleOld = старая накидка
    .desc = Изношенная тканевая обёртка, выцветшая с годами. Слабо пахнет сигарами.

ent-ClothingNeckMantleUnathi = плащ из шкур
    .desc = Довольно жуткие высушенные обрезки шкур и кожи, сшитые вместе в потрепанного вида мантию.

ent-ClothingNeckMantleCaptainAlt = роскошная наплечная мантия капитана
    .desc = Немногие могут удостоится чести носить такие накидки. Другие стоят на плечах гигантов. Вы - тот гигант, на плечах которого они стоят.

# Old/Original
ent-ClothingNeckMantleRDOriginal = королевская мантия
    .desc = Мантия королевского фиолетового. Ничего другого королевского в ней нет.

ent-ClothingNeckMantleCEOriginal = технологическая мантия
    .desc = Эта высокотехнологичная мантия - пик инженерной мысли, напоминание о том, что будущее уже наступило.

ent-ClothingNeckMantleCMOOriginal = мантия мастера медицины
    .desc = Мантия в цветах, символизирующих выдающиеся компетенции в различных областях медицины, будь то хирургия или химия.
