ent-BaseConspiratorObjective = { ent-BaseObjective }
    .desc = { ent-BaseObjective.desc }

ent-ConspiratorUnionObjective = Захватить отдел под свой контроль.
    .desc = Возьмите под контроль отдел и установите там свои порядки.

ent-ConspiratorGameshowObjective = Устроить шоу "не на жизнь, а на смерть".
    .desc = Заставьте экипаж принять участие в игровом шоу с невероятно высокими ставками.

ent-ConspiratorTechnologyObjective = Завладеть технологиями станции.
    .desc = Покажите экипажу достоинства примитивной жизни. Ведь только вы заслуживаете технологического чуда.

ent-ConspiratorArmsObjective = Разоружить СБ, вооружившись самостоятельно.
    .desc = Заберите оружие у Службы Безопасности и раздайте среди своих. СБ нельзя доверять с оружием.

ent-ConspiratorThiefObjective = Провернуть величайшее ограбление всех времён.
    .desc = Впишите свои имена в учебники истории за то, что вы унесёте с этой станции.

ent-ConspiratorMafiaObjective = Основать преступный клан.
    .desc = Станьте лидерами организованной преступности на этой станции и закрепите за собой репутацию группировки, с которой лучше не связываться.

ent-ConspiratorArrestObjective = Заставить Службу Безопасности арестовывать невиновных.
    .desc = Продемонстрируйте всем их некомпетентность, показав, как легко их надурить.

ent-ConspiratorCameraObjective = Избавиться от всеобщего корпоративного надзора.
    .desc = Верните сотрудникам Nanotrasen право на неприкосновенность частной жизни, уничтожив камеры и средства слежки.
