ent-PlushieCaptain = плюшевый капитан НаноТразен
    .desc = Плюшевая игрушка красноволосого работника НаноТразен. Кажется, это - капитан. От взгляда на неё появляется чувство тревоги.
    .suffix = Алиса Менск

ent-PlushieHeadOfSecurity = плюшевый глава службы безопасности
    .desc = Очаровательная игрушка сотрудника службы безопасности НаноТразен, напоминающая главу службы безопасности. Одного взгляда достаточно, чтобы начать ей гордиться.
    .suffix = Морган Блэкхенд

ent-PlushieInternalAffairsAgent = плюшевый агент внутренних дел
    .desc = Игрушка, похожая на агента юридического отдела НаноТразен. Мрачное напоминание того, что могло бы быть.
    .suffix = Эрхард Мильх

ent-PlushieChiefMedicalOfficer = плюшевый главный врач
    .desc = Милая игрушка, напоминающая работника в официальной униформе главного врача НаноТразен. К сожалению, она не организует отдел за вас.
    .suffix = Мирослава Осадчая

ent-PlushieMedicalWorker = плюшевый медик
    .desc = Очаровательная игрушка в форме медицинского работника. Стоит последовать её примеру, чтобы стать профессиональным медиком.
    .suffix = Калисто Эйнджер

ent-PlushieParamedic = плюшевый парамедик
    .desc = Мягкая игрушка, напоминающая врача скорой помощи. По какой-то причине очки с неё снять нельзя.
    .suffix = Эндрю Виггин

ent-PlushieVirologist = плюшевый вирусолог
    .desc = Красивая игрушка в форме вирусолога. Он не хотел для себя такой судьбы.
    .suffix = Лазарь Ангелов

ent-PlushieChemist = плюшевый химик
    .desc = Милая плюшевая игрушка в униформе химика. Кажется, её тяготит одно только ваше присутствие. Не то, чтобы она могла хоть что-либо с этим сделать.
    .suffix = Оцион Раноинт

ent-PlushieBartenderSlime = плюшевый слайм-бармен
    .desc = Милая игрушка бармена-слаймолюда, распространяемая в рамках показательной инициативы по борьбе с дискриминацией по видовому признаку в рабочей среде. Да предложит она напиток в трудные времена.
    .suffix = Кисс Рейз

ent-PlushieServiceWorker = плюшевый сервисный работник
    .desc = Милая игрушка работника бара. Она выглядит приятно и успокаивающе.
    .suffix = Эва Реи

ent-PlushieQuartermaster = плюшевый квартирмейстер
    .desc = Плюшевая игрушка 100% работника НаноТразен в полном скафандре и униформе квартирмейстера. Не беспокойтесь, она полностью лояльна корпорации.

ent-PlushieLizardQM = плюшевый унатх-квартирмейстер
    .desc = Модификация официальной плюшевой игрушки унатха НаноТразен. Кажется, она одета в униформу квартирмейстера. Скажи «Нет» расизму в профессиональной среде.
    .suffix = Графф Батон

ent-PlushieSalvageSpecialist = плюшевый утилизатор
    .desc = Официальная плюшевая игрушка НаноТразен, выпускаемая в стильном утилизаторском дизайне. Как будто бы одной только крутизны профессии недостаточно.
    .suffix = Сурен Суворов

ent-PlushieLizardBex = плюшевый унатх-смотритель
    .desc = Очаровательная мягкая игрушка красного цвета. От игрушки веет бесстрашностью.
    .suffix = Бекс Бесстрашный

ent-PlushieLizardHart = плюшевый коричневый унатх
    .desc = Очаровательная мягкая игрушка тёмно-коричневого цвета. Пахнет лекарствами.
    .suffix = Харт-Манн

ent-PlushieLizardMetaku = плюшевый фиолетовый унатх
    .desc = Очаровательная мягкая игрушка фиолетового цвета. Игрушка выглядит решительной.
    .suffix = Метаку Решительный

ent-PlushieLizardReesa = плюшевый унатх-альбинос
    .desc = Очаровательная мягкая игрушка белого цвета. Взгляд игрушки выглядит недовольным.
    .suffix = Рееса-Шанви
