ent-ClothingBackpackDuffelHop = вещмешок главы персонала
    .desc = Большой вещмешок для хранения дополнительных бюрократических принадлежностей.

ent-ClothingBackpackDuffelChiefMedicalOfficer = вещмешок главного врача
    .desc = Большой стерильный вещмешок для одновременного выполнения обязанностей всего медицинского отдела.

ent-ClothingBackpackDuffelCargoDark = тёмный вещмешок снабжения
    .desc = Большой вещмешок для воровства драгоценной добычи.

ent-ClothingBackpackDuffelRobotics = вещмешок робототехника
    .desc = Вместительный и прочный вещмешок, что точно переживёт восстание машин.
