reagent-name-opium = опиум
reagent-desc-opium = Сильнодействующий наркотик, получаемый из снотворного мака. Во время его отрытия использовался как болеутоляющее средство, однако из-за последствий в виде наркотической зависимости у пациентов начал применяться только как сырьё для медицинских препаратов.
reagent-name-blueskydesoxyephedrine = голубой дезоксиэфедрин
reagent-desc-blueskydesoxyephedrine = Более эффективный Эфедрин, имеющий более выраженные побочные эффекты. Требует меньшей дозы для профилактики нарколепсии.
