ent-ClothingOuterArmorBasicOriginal = панцирный бронежилет
    .desc = Старый военный бронежилет, обеспечивающий отличную защиту от большей части оружия.

ent-ClothingOuterArmorCaptainCarapaceWhite = белый панцирь капитана
    .desc = Бронированный нагрудник, обеспечивающий защиту и при этом обладающий мобильностью и гибкостью. Выдаётся только лучшим представителям станции. Белый цвет - символ чистоты и порядка.

ent-ClothingOuterArmorReactive = реактивная броня
    .desc = Комплект экспериментальной брони, в ожидании установки ядра аномалии.
    .suffix = НЕ МАППИТЬ
